/**
 * 1. URL  统一资源定位符 
 *    就是网址
 *     https://www.taobao.com/:8080/a/b/index.html?id=3&name=tom&age=10
 *    URL一般包括:
 *     协议:  http   https  必须有
 *     域名:  其实就是IP的别名 域名和IP是对应,每一个域名后面都对应一个IP地址   必须有
 *     端口号:  必须有  默认80是看不见的  用来区分电脑中的应用程序
 *     路径:  就好比是服务器端的文件夹
 *     参数:  就是浏览器端发送给服务器端的数据 在URL当中以?开始,后面的参数都是键=值的格式,如果有多个要用&连接
 * 
 * 2. DNS服务器
 *      域名映射服务器,将域名和IP地址进行一个映射 
 *       https://www.baidu.com/   182.61.200.7
 *       www.taobao.com           220.113.152.235
 *       www.jd.com               124.200.55.1
 *       www.mi.com               220.112.197.180   .edu  .gov  .com  .cn  .net 
 * 3. IP地址 
 *     IP地址就是网络中的地址,是用来定位网络中的终端设备,终端设备比如说:手机,电脑,平板,智能手机,智能汽车,智能空调...
 * 
 * 4. 服务器 
 *      就是安装了服务软件的机器或电脑
 * 
 * 5. 端口号：
 *      用来区分电脑中的应用程序  比如:浏览器  内网通  数据库 微信  阿里旺旺 QQ  飞秋...
 *      应用程序就好比是我们这个大楼中的房间,端口号就相当于是房间的门牌号
 */